title: 创建文件@Please_Read_Me@.txt
author: 张德民
date: '2025-11-12'

logsource:
  product: windows
  service: sysmon
  category: file_event
detection:
  selection:
   TargetFilename|contains: '@Please_Read_Me@.txt'
  condition: selection
level: high