title: 创建进程taskdl.exe
author: 张德民
date: '2025-11-12'

logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection1:
   Image|contains: 'taskdl.exe'
  condition: selection1
level: high