title: 创建进程conhost.exe
author: 张德民
date: '2025-11-12'

logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection1:
   Image|contains: 'conhost.exe'
  selection2:
   ParentImage|contains: 'taskhsvc.exe'
  condition: selection1 and selection2
level: high