title: 进程cmd.exe修改后缀
author: 张德民
date: '2025-11-12'

logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection1:
   Image|contains: 'cmd.exe'
  selection2:
   CommandLine|contains: '/c'
   CommandLine|contains: 'ren'
   CommandLine|contains: '.exe'
  selection3:
   ParentImage|contains: 'wscript.exe'
  condition: selection1 and selection2 and selection3
level: high