title: 创建进程wscript.exe
author: 张德民
date: '2025-11-12'

logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
   Image|contains: 'wscript.exe'
  condition: selection
level: high