title: 通过wscript.exe创建恶意进程
author: 张德民
date: '2025-11-12'

logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
   Image|contains: 'wscript.exe'
   ParentImage|contains: '5-BossDaMajor.exe'
  condition: selection
level: critical