title: 启动记事本进程
author: 张德民
date: '2025-11-12'

logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
   Image|contains: 'notepad.exe'
  condition: selection
level: high