title: 清空桌面
author: 张德民
date: '2025-11-12'

logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
   Image|contains: 'taskkill.exe'
   CommandLine|contains:  'taskkill /f /im explorer.exe'
   ParentImage|contains: '4-yhzll.exe'
  condition: selection
level: critical