title: 检测 del 强制删除 C:\Windows\System32 所有文件
author: 张德民
date: '2025-11-13'
description: 监测del 递归、强制、静默删除 C:\Windows\System32 目录下所有文件
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection_del:
    Image|contains: 'cmd.exe'
    CommandLine|contains: 'del /s /q /f C:\Windows\system32\*.*'
  condition: selection_del
level: critical