title: 浏览器访问了ixigua.com 这个网址
author: 张德民
date: '2025-11-13'
description: 监测网址
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    Image|contains: 'msedge.exe'
    CommandLine|contains: 'www.ixigua.com'
  condition: selection
level: critical