title: 检测 takeown 递归取得 C:\Windows\System32 所有权
author: 张德民
date: '2025-11-13'
description: 监测takeown 递归取得 C:\Windows\System32 所有权
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection_takeown:
    Image|contains: 'takeown.exe'
    CommandLine|contains: 'takeown  /f C:\Windows\system32 /r /d y'
  condition: selection_takeown
level: critical